#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<stdlib.h>
#include < math.h >
void main()
{
	int i, j;//счетчики для циклов
	int num;//размерность массива
	int kolvo = 0;//количество разрядов в размере массива, дробная часть
	double min, max;//минимальное и максимальное значения
	double x;//переменная для случайного значения
	int s = 0;
	double sum = 0;//сумма элементов массива
	int flag = 0;//флаг
	double* mas;//динамический массив
	printf("vvedite kolichestvo chisel ");
	scanf("%d", &num);
	s = num;
	while (s > 0)//подсчет количества разрядов в значении размерности массива
	{
		s = (s - (s % 10)) / 10;
		kolvo++;
	}
	printf("\nvvedite nizhnyu granitsu ");
	scanf("%lf", &min);
	printf("\nvvedite verhnyu granitsu ");
	scanf("%lf", &max);
	mas = (double*)malloc(num * sizeof(double));//ввод массива
	for (i = 0; i < num; i++)
	{
		x = rand();
		mas[i] = ((x / RAND_MAX) * (max - min)) + min;//преобразование элемента массива, установка нижней и верхней границ
		s = (int)(mas[i] * 1000000);
		s = (int)s % ((int)pow(10, (6 - kolvo)));//присваиваем переменной значение ненужной дробной части числа
		mas[i] = (int)((mas[i] * 1000000) - s);//вычитаем ненужную дробную часть числа, оставляем в дробной части столько значащих чисел, сколько разрядов в размерности массива
		mas[i] = mas[i] / ((int)pow(10, (6 - kolvo)));//преобразуем число так, чтобы в дробной части остались нули
		floor(mas[i]);//округляем число, чтобы при сумме не добавлялись числа в дробной части
		mas[i] = mas[i] / ((int)pow(10, kolvo));// приходим к изначальному числу mas[i], только с kolvo числами в дробной части
		printf("mas[%d]=%lf\n", i, mas[i]);//вывод массива
		for (j = 0; j < i; j++)//вкладываем еще один цикл, чтобы сравнить номер i с дробной частью чисел исходных чисел
		{
			s = (int)(mas[j] * (int)pow(10, kolvo));//находим дробную часть числа
			s = (int)s % ((int)pow(10, kolvo));
			if (s == i)//если мы находим такое число, номер у которого совпадает с дробной частью одного из исходных чисел, то флаг равняется единице
				flag = 1;
		}
		if (flag == 1)//если флаг равен единице, то мы вычитаем число из общей суммы, в противном случае - складываем
			sum -= mas[i];
		else
			sum += mas[i];
		flag = 0;// обнуляем флаг

	}
	printf("summa=%lf", sum);//вывод суммы, посчитанной согласно условию задачи

}